{
  "home": "Startseite",
  "about": "Über mich",
  "projects": "Projekte",
  "articles": "Artikel",
  "contact": "Kontakt",
  "greeting": "Hallo, ich bin Gaye Dinç",
  "intro": "Als Frontend-Entwickler der in Istanbul lebt habe ich durch die Ausbildung an der Acunmedya Akademie eine solide Grundlage in modernen Webtechnologien aufgebaut. Mit diszipliniertem Arbeiten und sauberen Code-Prinzipien nutze ich HTML, CSS, JavaScript und React um benutzerzentrierte und interaktive Projekte zu entwickeln. Angetrieben von meinem Engagement für kontinuierliches Lernen und Wissensaustausch, strebe ich danach, der Branche innovative Lösungen zu bieten. Ich bin hier, um Ihnen meine Projekte vorzustellen. Willkommen!",
  "aboutme": "Über Mich",
  "career": "Meine Karriere- und Bildungslaufbahn",
  "contaxt_text": "Wenn Sie mehr über meine Projekte erfahren oder mögliche Kooperationen erkunden möchten würde ich mich freuen, mit Ihnen in Kontakt zu treten! Zögern Sie nicht, mich zu kontaktieren, um Ihre Ideen zu teilen, über Ihre Projekte zu sprechen und herauszufinden, was wir gemeinsam erreichen können. Ich bin immer offen für neue Verbindungen und kreative Zusammenarbeit!",
  "send_email": "Schick mir eine E-Mail",
  "download_cv": "Lebenslauf herunterladen",
  "language_changed": "Sprache erfolgreich geändert",
  "theme-changed": "Thema erfolgreich geändert",
  "link": "LIVELINK",
  "career_text": "Als Absolvent der Sozialen Arbeit begann ich meine Karriere, doch mein Interesse an der Welt der Softwareentwicklung führte mich zur Frontend-Entwicklung. Durch die grundlegende Front-End-Ausbildung an der Acunmedya Akademie und die fortgeschrittene Ausbildung, die ich derzeit absolviere, habe ich eine solide Grundlage in Technologien wie HTML, CSS, JavaScript und React aufgebaut.",
  "projects_teamwork": "Projekte, Teamarbeit und Clean-Code-Philosophie",
  "projects_teamwork_text": "Während meiner Ausbildung habe ich an verschiedenen anspruchsvollen Projekten gearbeitet. Jedes Projekt hat mich mit unterschiedlichen Code-Strukturen vertraut gemacht und wertvolle praktische Erfahrungen vermittelt. Während der Teamarbeit habe ich das Git-Versionierungssystem effektiv genutzt, um meine Kommunikationsfähigkeiten zu verbessern und unseren kollektiven Arbeitsablauf zu stärken. Außerdem habe ich die Prinzipien des sauberen Codings und eines organisierten, disziplinierten Arbeitsstils übernommen. Die Kommentare in meinem Code dienen mir als Referenz, wenn ich meine Projekte erneut überprüfe.",
  "learning_sharing": "Wissensaustausch und kontinuierliche Entwicklung",
  "learning_sharing_text": "Jedes Projekt hat mir geholfen in meinem Fachgebiet voranzukommen, und hat zu meiner kontinuierlichen Entwicklung beigetragen. Die erlernten Code-Strukturen und technischen Kenntnisse dienen nicht nur als persönliche Referenz, sondern werden auch durch die Artikel, die ich auf Medium schreibe, mit der Gemeinschaft geteilt, um anderen zu helfen.",
  "future_vision": "Blick in die Zukunft",
  "future_vision_text": "Ich konzentriere mich weiterhin darauf, innovative und lösungsorientierte Projekte in der Softwarebranche zu entwickeln, indem ich meine Erfahrungen und disziplinierte Arbeitsweise optimal nutze. Mein Engagement für kontinuierliches Lernen und meine Offenheit für technologische Innovationen ermöglichen es mir benutzerfreundliche und interaktive Web-Erlebnisse zu entwickeln.",
  "entertainment_web_app_text": "Die Entertainment Web App ist eine Plattform, auf der Nutzer Filme und Serien entdecken und ihrer persönlichen Favoritenliste hinzufügen können. Das Projekt wurde mit Next.js neu aufgebaut und um Supabase zur Benutzeranmeldung und personalisierten Datenverwaltung erweitert. Jeder Nutzer kann ausschließlich seine eigenen gespeicherten Inhalte sehen. Alle Daten werden dynamisch aus der Supabase-Datenbank geladen, wobei der globale Zustand über useContext verwaltet und die Navigation mit dem App Router von Next.js umgesetzt wird. Mit einem mobilfreundlichen Design bietet die App eine klare und moderne Benutzererfahrung.",
  "blog_page_text": "In diesem Projekt verwende ich die hash-basierte Routing-Struktur mit React, um die Navigation der Anwendung zu verwalten, und useContext für das Umschalten des Themas. Ich verwalte Daten über API mit POST-, PUT- und DELETE-Operationen. Die Sicherheit wird durch die Validierung von Benutzername und Passwort gewährleistet, sodass nur eingeloggte Benutzer Beiträge bearbeiten und löschen können. Das Design habe ich selbst erstellt, um eine benutzerfreundliche und moderne Benutzeroberfläche anzubieten. Das Projekt hat die API erfolgreich integriert und bietet eine sichere und funktionale Erfahrung.",
  "rest_countries_text": "Dieses Projekt ist eine React-Anwendung, die dynamisch Informationen über Länder der Welt anzeigt. Benutzer können zwischen Ländern suchen, nach Regionen filtern und die gewünschten Länder finden. Für jedes Land werden detaillierte Basis- und Zusatzinformationen bereitgestellt. Der Dunkelmodus unterstützt die Personalisierung der Benutzererfahrung, und die Themenpräferenzen werden im lokalen Speicher gespeichert. Mit hash-basiertem Routing und responsivem Design bietet die Anwendung eine benutzerfreundliche Erfahrung auf allen Geräten.",
  "dev_jobs_text": "Die DevJobs Web App ist eine React-Anwendung, die als Gruppenprojekt mit Gökdeniz Keleş bei Acunmedya Akademi entwickelt wurde und es Benutzern ermöglicht, Entwickler-Jobanzeigen zu filtern und anzuzeigen. Dynamische Datenverwaltung und Filterfunktionen ermöglichen es, Jobanzeigen einfach zu suchen und zu sortieren. Mit der Themenverwaltung können Benutzer zwischen Dunkel- und Hellmodus wechseln, und Präferenzen werden im lokalen Speicher gespeichert. Das Mobile-First-Design und flexible Strukturen sorgen für eine benutzerfreundliche Erfahrung auf allen Bildschirmgrößen. Jobanzeigen können angeklickt werden, um detaillierte Karten mit Informationen anzuzeigen.",
  "dictionary_web_app_text": "Die Dictionary App ist eine React-Anwendung, die es Benutzern ermöglicht, schnell auf Wortbedeutungen, Aussprachen, Synonyme und Beispielsätze zuzugreifen. Wortdaten werden dynamisch über die API abgerufen, sodass Benutzer die gesuchten Wörter schnell finden können. Mit der Themenverwaltung können Benutzer zwischen Hell- und Dunkelmodus wechseln, und Präferenzen werden im lokalen Speicher gespeichert. Die Anwendung bietet drei verschiedene Schriftartenoptionen, um die Benutzererfahrung zu bereichern. Die Anwendung wurde dank der modularen Struktur von React schneller und nachhaltiger gemacht.",
  "markdown_editor_text": "Der Markdown Editor ist eine React-Anwendung, die die Markdown-Schriften der Benutzer sofort in Vorschauen umwandelt. Benutzer können neue Dateien erstellen, bestehende aktualisieren und löschen, und Änderungen werden mit LocalStorage gespeichert. Mit der Themenverwaltung können Benutzer zwischen Hell- und Dunkelmodus wechseln. Das responsive Design sorgt für eine mobile-first Erfahrung, die mit allen Geräten kompatibel ist. Dateioperationen wurden dynamisch und interaktiv gestaltet, um die Benutzererfahrung zu verbessern.",
  "frontend_quiz_text": "Die Frontend Quiz App ist eine interaktive Quiz-Anwendung, die 10-Fragen-Tests in den Kategorien HTML, CSS, JavaScript und Accessibility anbietet. Benutzer wählen eine dieser vier Kategorien aus und beginnen, Fragen zu beantworten. Korrekte und falsche Antworten werden visuell auf dem Ergebnisbildschirm angezeigt, und die richtige Antwort wird sofort angezeigt, wenn der Benutzer eine falsche Antwort gibt. Die Anwendung gibt dem Benutzer Feedback, bevor sie zwischen den Fragen wechselt, wodurch der Lernprozess interaktiver wird. Mit der Themenverwaltung können Benutzer zwischen Hell- und Dunkelmodus wechseln, und die Themenpräferenzen werden im lokalen Speicher gespeichert.",
  "memory_game_text": "Memory Game ist eine unterhaltsame Spielanwendung, bei der die Spieler Karten paarweise aufdecken müssen, um voranzukommen. Die Karten werden zu Beginn gemischt, und jedes neue Spiel zeigt eine andere Anordnung. Wenn die ausgewählten Karten übereinstimmen, wird dem Benutzer eine Rückmeldung gegeben, und das Spiel endet, wenn alle Karten übereinstimmen. Das Spiel verfügt auch über einen Timer und einen Zugzähler. Mit dem Mobile-First-Design bietet das Spiel eine kompatible Erfahrung auf allen Geräten.",
  "product_list_with_card_text": "In diesem Projekt können Benutzer Produkte in ihren Warenkorb legen, Mengen ändern und den Gesamtbetrag in Echtzeit anzeigen. Wenn ein Produkt zum Warenkorb hinzugefügt wird, erhöht sich die Menge automatisch, und der Gesamtbetrag wird in Echtzeit neu berechnet. Mit dem Mobile-First-Design bietet die Anwendung eine kompatible Erfahrung auf sowohl Desktop- als auch Mobilgeräten.",
  "post_list_text": "In diesem Projekt habe ich es den Benutzern ermöglicht, verschiedene Beiträge anzuzeigen und die Kommentare zu jedem Beitrag dynamisch zu durchsuchen. Daten werden aus drei verschiedenen API-Endpunkten abgerufen, um dynamische Inhalte für Beitragslisten, Beitragsdetails und Kommentare bereitzustellen. Ich habe die Daten mit useState und Prop Drilling verwaltet. Die Anwendung ist sowohl für Desktop- als auch für Mobilgeräte optimiert und bietet ein modernes CSS-Techniken und ein responsives Design.",
  "landing_page_text": "In diesem Projekt habe ich zusammen mit Hilal Baran und Atakan Arıkan ein Git-basiertes Teamprojekt durchgeführt. Mit Git-Versionierungssystemen haben wir das Projekt organisiert und effizient entwickelt. Wir haben eine Landing Page mit HTML und CSS gestaltet, die die Abschnitte Careers, Blog, Pricing, Help & Support, About und Contact Us enthält. Durch das Erleben der Bedeutung der Teamarbeit haben wir unsere Frontend-Fähigkeiten gestärkt.",
  "kanban_text": "Während des Acunmedya Academy Bootcamps haben wir zusammen mit İrem Çoban und Mehmet Akif Küçükyılmaz die Kanban Task Management Web App entwickelt. Nutzer können Boards und Spalten erstellen, Aufgaben hinzufügen, bearbeiten, verschieben und löschen. Alle Daten werden in localStorage gespeichert, um Datenverlust zu vermeiden. Durch ein responsives Design und den Dark-Mode-Support wurde die Benutzererfahrung verbessert. Die React-State-Verwaltung wurde effektiv genutzt, um eine dynamische Struktur zu schaffen, und mit React Hot Toast wurden Echtzeit-Benachrichtigungen integriert. Bald planen wir, die Interaktion zu verbessern, indem wir eine Drag-and-Drop-Funktion mit der @dnd-kit-Bibliothek hinzufügen.",
  "product_feedback_text": "Während des Acunmedya Academy Bootcamps hat unser Team erfolgreich das Product Feedback App-Projekt abgeschlossen. Wir haben das GIT-Versionskontrollsystem effektiv für die Zusammenarbeit genutzt. Nutzer können Kommentare beantworten, neue hinzufügen, bearbeiten und löschen. Die Kommentare wurden nach Tags kategorisiert, sodass Nutzer sie filtern können, und wir haben ein Sortiermenü erstellt, um die am meisten/wenigsten geliketen oder kommentierten Feedbacks anzuzeigen. Eine Roadmap-Seite wurde entwickelt, um den Status der Kommentare zu verfolgen. Für die Navigation haben wir Hash-Routing verwendet und mit React Hot Toast Echtzeit-Benachrichtigungen integriert. Alle Daten werden in localStorage gespeichert, um Datenverlust zu verhindern. In Zukunft planen wir, die Benutzererfahrung durch die Integration eines Authentifizierungssystems weiter zu verbessern.",
  "xox_game": "Dieses Projekt ist eine React-Anwendung, die das klassische Tic-Tac-Toe-Spiel mit einer modernen Benutzeroberfläche und Nutzeranmeldung neu interpretiert. Nutzer wählen zunächst ein Spiel aus und melden sich an, bevor sie ihr Symbol (X oder O) festlegen. Während des Spiels werden Siege, Niederlagen und Unentschieden erkannt und die Punktestände entsprechend aktualisiert. Beim Start einer neuen Runde bleiben die Punktestände erhalten. Dank Dark-Mode-Unterstützung und responsivem Design wird ein reibungsloses Spielerlebnis auf allen Geräten geboten. Die Spielereinstellungen werden lokal gespeichert, und die globale Zustandsverwaltung erfolgt über die Context API. Dieses benutzerfreundliche Design, das durch starke Teamarbeit entstand, zeigt die effektive Nutzung des React-Ökosystems."
}