{
  "home": "Home",
  "about": "About Me",
  "projects": "Projects",
  "articles": "Articles",
  "contact": "Contact Me",
  "greeting": "Hello, I'm Gaye Dinç",
  "intro": "As a frontend developer living in Istanbul I have built a solid foundation in modern web technologies through the training I received at Acunmedya Akademi. I utilize HTML, CSS, JavaScript, and React with disciplined work and clean code principles to develop user-centric and interactive projects. Driven by my commitment to continuous learning and knowledge sharing, I strive to deliver innovative solutions to the industry. I am here to showcase my projects to you. Welcome!",
  "aboutme": "About Me",
  "career": "My Career and Educational Journey",
  "contaxt_text": "If you'd like to learn more about my projects or explore potential collaborations I'd be delighted to connect with you! Feel free to reach out to discuss your ideas, talk about your projects, and discover what we can achieve together. I'm always open to new connections and creative collaborations!",
  "send_email": "Send Me an Email",
  "download_cv": "Download CV",
  "language_changed": "Language changed successfully",
  "theme-changed": "Theme changed successfully",
  "link": "LIVE LINK",
  "career_text": "Starting my career as a social services graduate my interest in the software world led me to frontend development. Through the fundamental Front-End training I received at Acunmedya Academy and the advanced education I am currently pursuing, I have built a strong foundation in technologies such as HTML, CSS, JavaScript, and React.",
  "projects_teamwork": "Projects, Teamwork, and Clean Code Philosophy",
  "projects_teamwork_text": "Throughout my education I have worked on various challenging projects. Each project introduced me to different code structures and turned into valuable real-world experiences. During teamwork, I effectively used the Git version control system, enhancing my communication skills and strengthening our collective workflow. Additionally, I embraced the principles of writing clean code and working in an organized, disciplined manner. The comments in my code serve as a reference that guides me when I review my projects.",
  "learning_sharing": "Knowledge Sharing and Continuous Development",
  "learning_sharing_text": "Each project has helped me advance in my field and contributed to my continuous growth. The code structures and technological knowledge I have learned are not only for personal reference but are also shared with the community through the articles I write on Medium, helping others as well.",
  "future_vision": "Looking Ahead",
  "future_vision_text": "I continue to use my experiences and disciplined work principles to focus on producing innovative and solution-oriented projects in the software world. My commitment to continuous learning and openness to technological innovations enable me to develop user-friendly and interactive web experiences.",
  "entertainment_web_app_text": "Entertainment Web App is a platform where users can discover movies and TV series and add them to their personal favorites list. The project was rebuilt with Next.js, and Supabase was integrated for user authentication and personalized data management. Each user can only view their own bookmarked content. All data is dynamically fetched from the Supabase database, with global state managed via useContext and routing handled through the Next.js App Router. Designed with a mobile-first approach, the app offers a clean and modern user experience.",
  "blog_page_text": "In this project I use hash routing structure with React to manage application navigation and useContext for theme switching. I manage data using API with POST, PUT, and DELETE operations. Security is ensured with username and password validation, allowing only logged-in users to edit and delete posts. I created the design myself to offer a user-friendly and modern interface. The project successfully integrated API, providing a secure and functional experience.",
  "rest_countries_text": "This project is a React application that dynamically displays information about world countries. Users can search between countries, filter by regions, and find the countries they are looking for. Detailed basic and additional information is provided for each country. Dark mode support personalizes the user experience, and the theme preference is stored in local storage. With hash-based routing and responsive design, the application offers a user-friendly experience on all devices.",
  "dev_jobs_text": "DevJobs Web App is a React application developed as a group project with Gökdeniz Keleş at Acunmedya Akademi, which allows users to filter and view developer job listings. Dynamic data management and filtering features allow job listings to be easily searched and sorted. With theme management, users can switch between dark and light modes, and preferences are saved in local storage. Mobile-first design and flexible structures ensure a user-friendly experience on all screen sizes. Job listings can be clicked to view detailed cards with information.",
  "dictionary_web_app_text": "The Dictionary App is a React application that allows users to easily access word meanings, pronunciations, synonyms, and example sentences. Word data is dynamically fetched via API, allowing users to quickly find the words they are looking for. With theme management, users can switch between light and dark modes, and preferences are stored in local storage. The app offers three different font options to enrich the user experience. The application is made faster and more sustainable due to React's modular structure.",
  "markdown_editor_text": "Markdown Editor is a React application that instantly converts users' Markdown writings into previews. Users can create new files, update and delete existing ones, and changes are saved with localStorage. With theme management, users can switch between light and dark modes. The responsive design ensures a mobile-first experience that is compatible with all devices. File operations are dynamically and interactively designed to improve the user experience.",
  "frontend_quiz_text": "Frontend Quiz App is an interactive quiz application that offers 10-question tests in HTML, CSS, JavaScript, and Accessibility categories. Users choose one of these four categories and start answering questions. Correct and incorrect answers are visually shown on the results screen, and the correct answer is immediately displayed when the user provides an incorrect answer. The application provides feedback to the user before moving between questions, making the learning process more interactive. Theme management allows users to switch between light and dark modes, and theme preferences are saved in localStorage.",
  "memory_game_text": "Memory Game is a fun game application where players match cards to progress. The cards are shuffled at the start, and each new game presents a different arrangement. Feedback is given when the selected cards match, and the game ends when all the cards are matched. The game also features a timer and move counter. With mobile-first design, the game offers a compatible experience on all devices.",
  "product_list_with_card_text": "In this project, users can add products to their cart, change quantities, and see the total amount in real-time. When a product is added to the cart, the quantity automatically increases, and the total amount is recalculated in real-time. With mobile-first design, the application offers a compatible experience on both desktop and mobile devices.",
  "post_list_text": "In this project, I enabled users to view different posts and dynamically explore the comments of each post. Data is fetched from three different API endpoints, providing dynamic content for post lists, post details, and post comments. I managed data using useState and prop drilling. The application is optimized for both desktop and mobile devices with modern CSS techniques and a responsive design.",
  "landing_page_text": "In this project, I collaborated with Hilal Baran and Atakan Arıkan on a Git-based team project. Using Git version control systems, we developed the project in an organized and efficient way. We designed a landing page with HTML and CSS, featuring Careers, Blog, Pricing, Help & Support, About, and Contact Us sections. By experiencing the importance of teamwork, we reinforced our frontend skills.",
  "kanban_text": "During the Acunmedya Academy bootcamp, we developed the Kanban Task Management Web App with İrem Çoban and Mehmet Akif Küçükyılmaz. Users can create boards and columns, add, edit, move, and delete tasks. All data is stored in localStorage to prevent data loss. With a responsive design and dark mode support, the user experience was improved. React state management was effectively used to create a dynamic structure, and React Hot Toast was integrated for real-time notifications. Soon, we plan to enhance interaction by adding a drag-and-drop feature using the @dnd-kit library.",
  "product_feedback_text": "During the Acunmedya Academy bootcamp, our team successfully completed the Product Feedback App project. We effectively utilized the GIT version control system for collaboration. Users can reply to comments, add new ones, edit, and delete them. We categorized comments by tags, allowing users to filter them, and created a sorting menu to display the most/least liked or commented feedback. A roadmap page was developed to track the status of comments. We implemented hash routing for navigation and used React Hot Toast for real-time notifications. All data is stored in localStorage to prevent data loss. In the future, we plan to enhance the user experience by integrating an authentication system.",
  "xox_game": "This project is a React application that reimagines the classic Tic Tac Toe game with a modern interface and user authentication. Users are greeted with a game selection screen and prompted to log in before choosing their mark (X or O). The game tracks wins, losses, and ties, updating the score accordingly. Scores are preserved when a new round starts. With dark mode support and a responsive design, the game offers a seamless experience across all devices. Player preferences are stored using local storage, and global state management is handled via the Context API. This user-friendly design, built through strong team collaboration, demonstrates effective use of the React ecosystem."
}