{
  "home": "Ana Sayfa",
  "about": "Hakkımda",
  "projects": "Projeler",
  "articles": "Makaleler",
  "contact": "İletişim",
  "greeting": "Merhaba, ben Gaye Dinç",
  "intro": "İstanbul'da yaşayan bir frontend geliştirici olarak Acunmedya Akademi'de aldığım eğitim sayesinde modern web teknolojileri konusunda sağlam bir temel oluşturdum. Kullanıcı odaklı ve etkileşimli projeler geliştirmek için HTML, CSS, JavaScript ve React'i disiplinli çalışma ve temiz kod ilkeleriyle kullanıyorum. Sürekli öğrenme ve bilgi paylaşımı konusundaki kararlılığım ile sektöre yenilikçi çözümler sunmayı hedefliyorum. Projelerimi sizlere sunmak için buradayım. Hoş geldiniz!",
  "aboutme": "Hakkımda",
  "career": "Kariyerim ve Eğitim Yolculuğum",
  "contaxt_text": "Projelerim hakkında daha fazla bilgi edinmek veya olası işbirliklerini değerlendirmek isterseniz sizinle tanışmaktan memnuniyet duyarım! Fikirlerinizi paylaşmak, projeleriniz üzerine konuşmak ve birlikte neler başarabileceğimizi keşfetmek için benimle iletişime geçmekten çekinmeyin. Yeni bağlantılar ve yaratıcı işbirlikleri için her zaman açık olduğumu bilmenizi isterim!",
  "send_email": "Bana E-Posta Gönder",
  "download_cv": "CV İndir",
  "language_changed": "Dil başarıyla değiştirildi",
  "theme-changed": "Tema başarıyla değiştirildi",
  "link": "CANLI LİNK",
  "career_text": "Sosyal hizmet mezunu olarak başladığım kariyerimde yazılım dünyasına olan ilgim beni frontend geliştirme alanına yönlendirdi. Acunmedya Akademi'de aldığım Front-End temel eğitimi ve şu anda devam ettiğim ileri düzey eğitim sayesinde HTML, CSS, JavaScript ve React gibi teknolojilerde sağlam bir temel oluşturdum.",
  "projects_teamwork": "Projeler, Takım Çalışması ve Temiz Kod Felsefesi",
  "projects_teamwork_text": "Eğitim sürecim boyunca çeşitli zorlu projelerde yer aldım. Her proje bana farklı kod yapıları tanıtarak gerçek dünyadaki değerli deneyimlere dönüştü. Takım çalışmaları sırasında Git versiyon kontrol sistemini etkin bir şekilde kullanarak iletişim becerilerimi geliştirdim ve kolektif iş akışımızı güçlendirdim. Ayrıca, temiz kod yazma ve düzenli, disiplinli çalışma prensiplerini benimsedim; kodlarımda yer alan yorum satırları projelerimi yeniden gözden geçirdiğimde bana rehberlik eden bir referans oluyor.",
  "learning_sharing": "Bilgi Paylaşımı ve Sürekli Gelişim",
  "learning_sharing_text": "Her proje uzmanlık alanımda ilerlememi sağladı ve sürekli gelişimime katkıda bulundu. Öğrendiğim kod yapıları ve teknolojik bilgiler sadece kişisel bir referans olarak değil Medium'da yazdığım makaleler aracılığıyla toplulukla paylaşarak başkalarına da yardımcı oluyorum.",
  "future_vision": "Geleceğe Bakış",
  "future_vision_text": "Yazılım dünyasında yenilikçi ve çözüm odaklı projeler üretmeye odaklanarak deneyimlerimi ve disiplinli çalışma prensiplerimi en iyi şekilde kullanmaya devam ediyorum. Sürekli öğrenmeye olan bağlılığım ve teknolojik yeniliklere açıklığım, kullanıcı dostu ve etkileşimli web deneyimleri geliştirmemi sağlıyor.",
  "entertainment_web_app_text": "Entertainment Web App kullanıcıların film ve dizileri keşfedip kendi hesapları üzerinden favorilerine ekleyebildiği bir platformdur. Proje Next.js ile yeniden inşa edilmiş, Supabase kullanılarak kullanıcı kimlik doğrulama ve kişiye özel veri yönetimi eklenmiştir. Her kullanıcı yalnızca kendi “bookmarked” içeriklerini görebilir. Tüm veriler Supabase veritabanından dinamik olarak çekilirken, global durum yönetimi için useContext, sayfa geçişleri için Next.js App Router yapısı kullanılmıştır. Mobil uyumlu tasarımıyla sade ve modern bir kullanıcı deneyimi sunar.",
  "blog_page_text": "Bu projede React ile hash router yapısı kullanarak uygulama yönlendirmelerini yönetiyor ve useContext ile tema değişimini sağlıyorum. API ile POST, PUT ve DELETE işlemleri yaparak veri yönetimi gerçekleştiriyorum. Kullanıcı adı ve şifre kontrolü ile güvenliği sağlıyorum, yalnızca giriş yapan kullanıcılar yazıları düzenleyebilir ve silebilir. Tasarımı kendim yaparak kullanıcı dostu ve modern bir arayüz oluşturuyorum. Proje, güvenli ve işlevsel bir deneyim sunarak API entegrasyonunu başarıyla sağladı.",
  "rest_countries_text": "Bu proje dünya ülkeleriyle ilgili bilgileri dinamik bir şekilde görüntüleyen bir React uygulamasıdır. Kullanıcılar ülkeler arasında arama yapabilir, bölgelere göre filtreleme yaparak istedikleri ülkelere ulaşabilirler. Her ülke için temel ve ek bilgilere detaylı bir şekilde erişim sağlanır. Karanlık mod desteği ile kullanıcı deneyimi kişiselleştirilmiş ve tema tercihi yerel depolama ile korunmuştur. Hash tabanlı yönlendirme ve responsive tasarım ile tüm cihazlarda kullanıcı dostu bir deneyim sunulmuştur.",
  "dev_jobs_text": "DevJobs Web App Gökdeniz Keleş ile Acunmedya Akademi'de bir grup projesi olarak geliştirdiğimiz, kullanıcıların developer iş ilanlarını filtreleyip detaylarına ulaşmalarını sağlayan bir React uygulamasıdır. Dinamik veri yönetimi ve filtreleme özellikleri eklenerek iş ilanları kolayca aranabilir ve sıralanabilir. Tema yönetimi ile kullanıcılar dark ve light mod arasında geçiş yapabilir, tercihler yerel depolama ile korunur. Mobil öncelikli tasarım ve esnek yapılar sayesinde tüm ekran boyutlarında kullanıcı dostu bir deneyim sunulmuştur. İş ilanlarına tıklanarak detaylı bilgiler içeren kartlara erişilebilir.",
  "dictionary_web_app_text": "Dictionary App kullanıcıların kelimelerin anlamlarına, telaffuzlarına, eş anlamlarına ve örnek cümlelerine kolayca erişmesini sağlayan bir React uygulamasıdır. API ile dinamik kelime verisi çekilir ve kullanıcıların aradıkları kelimeleri hızlıca bulmaları sağlanır. Tema yönetimi ile ışık ve karanlık mod arasında geçiş yapılabilir, tercihler yerel depolama ile korunur. Üç farklı yazı tipi seçeneği sunularak kullanıcı deneyimi zenginleştirilmiştir. Uygulama React'ın modüler yapısı sayesinde daha hızlı ve sürdürülebilir hale getirilmiştir.",
  "markdown_editor_text": "Markdown Editor kullanıcıların Markdown yazılarını anında önizlemeye dönüştüren bir React uygulamasıdır. Kullanıcılar yeni dosyalar oluşturabilir, var olan dosyaları güncelleyip silebilir ve yapılan değişiklikler localStorage ile korunur. Tema yönetimi ile kullanıcılar ışık ve karanlık mod arasında geçiş yapabilir. Uygulama responsive tasarımı sayesinde mobil öncelikli ve tüm cihazlarda uyumlu bir deneyim sunar. Dosya işlemleri dinamik ve etkileşimli bir şekilde tasarlanarak kullanıcı deneyimi iyileştirilmiştir.",
  "frontend_quiz_text": "Frontend Quiz App HTML, CSS, JavaScript ve Accessibility kategorilerinde 10 soruluk testler sunan interaktif bir quiz uygulamasıdır. Kullanıcılar bu dört kategori arasından birini seçerek soruları çözmeye başlarlar. Sorulara verilen doğru ve yanlış cevaplar sonuç ekranında kullanıcıya görsel olarak sunulurken yanlış cevap verildiğinde doğru cevap da hemen gösterilir. Uygulama her soru arasında geçiş yapmadan önce kullanıcıya geri bildirim verir böylece öğrenme süreci daha etkileşimli hale gelir. Tema yönetimi, kullanıcıların light ve dark mod arasında geçiş yapabilmesini sağlar ve tema tercihleri localStorage ile korunur.",
  "memory_game_text": "Memory Game oyuncuların kartları eşleştirerek ilerlediği eğlenceli bir oyun uygulamasıdır. Oyunda kartlar başlangıçta karıştırılır ve her yeni oyunda farklı bir düzen sunulur. Seçilen kartlar eşleştiğinde kullanıcıya geri bildirim verilir, tüm kartlar eşleştiğinde oyun sona erer. Ayrıca oyun sırasında zamanlayıcı ve hamle sayacı bulunur. Mobil öncelikli tasarımı ile tüm cihazlarda uyumlu bir deneyim sunar.",
  "product_list_with_card_text": "Bu projede kullanıcılar ürünleri sepete ekleyebilir, miktarlarını değiştirebilir ve toplam tutarı anlık olarak görüntüleyebilirler. Sepete bir ürün eklediğinde miktar otomatik artar, toplam tutar ise gerçek zamanlı olarak hesaplanır. Mobil öncelikli tasarımıyla hem masaüstü hem de mobil cihazlarda uyumlu bir deneyim sunar.",
  "post_list_text": "Bu projede kullanıcıların farklı postları görüntülemeleri ve her postun yorumlarını dinamik bir şekilde incelemelerini sağladım. Üç farklı API uç noktasından veri çekerek post listesi, post detayları ve post yorumları dinamik olarak sunuluyor. Verileri yönetmek için useState ve prop drilling kullandım. Uygulama hem masaüstü hem de mobil cihazlar için optimize edilmiş, modern CSS teknikleri ile responsive bir tasarıma sahip.",
  "landing_page_text": "Bu projede Hilal Baran ve Atakan Arıkan ile birlikte ortak bir Git çalışması gerçekleştirdik. Git versiyon kontrol sistemlerini kullanarak projeyi düzenli ve verimli bir şekilde geliştirdik. HTML ve CSS ile Careers, Blog, Pricing, Help & Support, About ve Contact Us sekmelerinden oluşan bir landing page tasarladık. Grup çalışmasının önemini deneyimleyerek  frontend becerilerimizi pekiştirdik.",
  "kanban_text": "Acunmedya Akademi'deki kamp sürecinde İrem Çoban ve Mehmet Akif Küçükyılmaz ile birlikte Kanban Task Management Web App geliştirdik. Kullanıcılar farklı board'lar ve sütunlar oluşturabilir, görev ekleyip düzenleyebilir, farklı sütunlara taşıyabilir ve silebilir. Tüm veriler localStorage’e kaydedilerek veri kaybı önlendi. Responsive tasarım ve karanlık mod desteği ile kullanım deneyimi iyileştirildi. React state yönetimi etkin kullanılarak dinamik bir yapı oluşturuldu ve React Hot Toast ile anlık bildirimler eklendi. Yakında, @dnd-kit kütüphanesi ile sürükle-bırak özelliği ekleyerek etkileşimi daha sezgisel hale getirmeyi planlıyoruz.",
  "product_feedback_text": "Acunmedya Akademi'deki kamp sürecinde ekibimizle birlikte Product Feedback App projesini tamamladık. Bu projede GIT versiyon kontrol sistemini etkin bir şekilde kullanarak iş birliği yaptık. Kullanıcılar yorumlara yanıt verebilir, yeni yorum ekleyebilir, düzenleyebilir ve silebilir. Yorumları etiketlere göre sınıflandırarak filtreleme imkanı sağladık ve en çok/beğenilen veya yorum alan içerikleri sıralayabilecekleri bir menü oluşturduk. Roadmap sayfasında yorumların durumlarını görüntüleyebilmeleri için bir sistem geliştirdik. Hash router ile sayfa geçişlerini sağlarken React Hot Toast ile anlık bildirimler ekledik. Tüm verileri localStorage'e kaydederek veri kaybını önledik. Gelecekte kimlik doğrulama sistemi ekleyerek kullanıcı deneyimini daha da geliştirmeyi planlıyoruz.",
  "xox_game": "Bu proje klasik XOX oyununu modern bir arayüz ve kullanıcı girişiyle yeniden tasarlayan bir React uygulamasıdır. Kullanıcılar oyun seçimi yaptıktan sonra giriş ekranı ile karşılanır ve X ya da O sembolünü seçerek oyuna başlar. Oyun sırasında kazanma, kaybetme ve beraberlik durumları algılanır, puanlar güncellenir. Her yeni tur başlatıldığında skorlar korunur. Karanlık mod desteği ve responsive tasarımıyla tüm cihazlarda akıcı bir oyun deneyimi sunar. Yerel depolama kullanılarak oyuncu tercihleri korunur, Context API ile global durum yönetimi sağlanır. Kullanıcı dostu tasarımı ve takım çalışmasıyla ortaya çıkan bu proje React ekosisteminin etkin kullanımını gösterir."
}